In [4]:
import pandas as pd
from sqlalchemy import create_engine

In [5]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://postgres:Tama1234@localhost:5432/Employee_DB')
conn = engine.connect()

In [6]:
data1=pd.read_sql("SELECT * FROM employees",conn)
data1.head()

   emp_no emp_title  birth_date  first_name  last_name sex   hire_date
0  473302     s0001  2053-07-25    Hideyuki   Zallocco   M  1990-04-28
1  475053     e0002  2054-11-18       Byong  Delgrande   F  1991-09-07
2   57444     e0002  2058-01-30       Berry       Babb   F  1992-03-21
3  421786     s0001  2057-09-28       Xiong   Verhoeff   M  1987-11-26
4  282238     e0003  2052-10-28  Abdelkader    Baumann   F  1991-01-18

In [7]:
metadata.tables.keys()

NameError: name 'metadata' is not defined